In [1]:

#1-Considere as tabelas de vendas diárias de três lojas
import pandas as pd
mercearia = pd.DataFrame({"loja":["A","A","A"],
"dia":["sex","sab","dom"],
"valor": [7500, 9500, 8200]})
                          
farmacia = pd.DataFrame({"loja":["B","B","B"],
"dia":["sex","sab","dom"],
"valor":[5100, 8250, 9900]})
                          
restaurante = pd.DataFrame({"loja":["C","C"],
"dia":["sab","dom"],
"valor":[7500, 11800]})

In [2]:
#Crie dois novos dataframes por meio da junção dos três acima, agrupando, para isso,
#os dataframes no sentido de linha para criar um, e no sentido de coluna para criar
#o segundo. Explique as diferenás entre as duas saídas, principalmente a ocorrência
#de valores NaN
pd.concat([mercearia, farmacia, restaurante], ignore_index=True)

  loja  dia  valor
0    A  sex   7500
1    A  sab   9500
2    A  dom   8200
3    B  sex   5100
4    B  sab   8250
5    B  dom   9900
6    C  sab   7500
7    C  dom  11800

In [3]:
#2. Com base nos dataframes a seguir, que guardam informações de matriculas de alunos
#em dois cursos, um de SQL e outro de Python:
SQL = pd.DataFrame({"email":["emilly@yahoo.com","evellyn@gmail.com"]})
PYTHON = pd.DataFrame({"email":["kalina@yahoo.com","afonso@hotmail.com","cecinha@yahoo.com,"]})

In [4]:
#(a) quais são os alunos distintos, considerando ambas as listas?
pd.merge(PYTHON,SQL, how="outer")

                email
0    kalina@yahoo.com
1  afonso@hotmail.com
2  cecinha@yahoo.com,
3    emilly@yahoo.com
4   evellyn@gmail.com

In [5]:
pd.merge(PYTHON,SQL, how="inner")

Empty DataFrame
Columns: [email]
Index: []

In [6]:
#(b) quais são os alunos que fizeram ambos os cursos?

SQL[SQL.email.isin(PYTHON.email)==False]

               email
0   emilly@yahoo.com
1  evellyn@gmail.com

In [7]:
#(c) quais os alunos que realizaram o curso de SQL, mas não o de PYTHON (e
#vice-versa)?
PYTHON[PYTHON.email.isin(SQL.email)==False]

                email
0    kalina@yahoo.com
1  afonso@hotmail.com
2  cecinha@yahoo.com,

In [8]:
#3. Considere os dois dataframes a seguir, referentes aos dados sobre os departamentos
#e os funcionários de uma empresa

dic_emp = {"id":["D1","D2","D3","D4"],
"nomDepto":["Compras","RH","TI","Vendas"],
"local":["SP","RJ","RJ","SP"]}
dic_func = {"num":[3199,3269,3555,3788,3844],
"nome":["cecinha","afonso","kalina","emilly","evellyn"],
"salario":[1600,2975,1500,5000,3000],
"idDepto":["D2","D3",None,"D2","D4"]}

In [9]:
empresa = pd.DataFrame(dic_emp)
funcionarios = pd.DataFrame(dic_func)

In [10]:

#Combine os dados dos funcionários com os dados dos departamentos para criar um
#novo dataframe completo sobre a empresa, usando merge
pd.merge(empresa,funcionarios,left_on="id",right_on="idDepto")

   id nomDepto local   num     nome  salario idDepto
0  D2       RH    RJ  3199  cecinha     1600      D2
1  D2       RH    RJ  3788   emilly     5000      D2
2  D3       TI    RJ  3269   afonso     2975      D3
3  D4   Vendas    SP  3844  evellyn     3000      D4